// 【问题描述】
// 一元多项式按照次数从小到大将系数存储在一个数组中，如[1,2,3,5]表示1+2x+3x^2+5x^3、[0,1,0,-1]表示0+x+0-x^3，数组的索引值代表变量的次数，系数均为整数。不考虑多项式为0，即数组为空的情况。
// 请实现两个多项式的乘法，即输入两个数组nums1和nums2，返回一个新的数组prodnums，prodnums表示的多项式是nums1表示的多项式和nums2表示的多项式的乘积。
// 【输入形式】
// m
// nums1
// n
// nums2
// 【输出形式】
// 数组produnms，按顺序输出，每个元素之间用空格隔开
// 【样例输入】
// 3
// 1 2 3
// 2
// 1 2
// 【样例输出】
// 1 4 7 6
// 【样例说明】
// m，n分别代表数组nums1和nums2的长度
// 输入文件名为in.txt
// 输出文件名为out.txt
// 【评分标准】
// 一共10个测试用例，每通过一个得10分。

//仍然是三步走，第一步是从"in.txt"中输入
//第二步是进行计算

